EDT/УТ/src/InformationRegisters/КонтрольВремени/КонтрольВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтрольВремени</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОкончаниеСобытия</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияКонтроляВремени</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаРейсов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Documents/РегистрацияСобытияКонтроляВремени/РегистрацияСобытияКонтроляВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РегистрацияСобытияКонтроляВремени</name>
  <registerRecords>InformationRegister.КонтрольВремени</registerRecords>
  <attributes>
    <name>Событие</name>
    <type>
      <types>CatalogRef.СобытияКонтроляВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеСобытия</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМеста</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаРейсов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Document>

EDT/УТ/src/CommonModules/УчетКонтроляВремениСервер/Module.bsl
Функция ПроверитьСостояниеСобытия(Событие, Рейс = Неопределено, Терминал = Неопределено, ДатаНачалаСобытия = Неопределено) Экспорт
	Если Рейс = Неопределено Тогда 
		Рейс = Документы.Рейс.ПустаяСсылка();
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КонтрольВремениСрезПоследних.Период КАК Период,
		|	КонтрольВремениСрезПоследних.ОкончаниеСобытия КАК ОкончаниеСобытия
		|ИЗ
		|	РегистрСведений.КонтрольВремени.СрезПоследних КАК КонтрольВремениСрезПоследних
		|ГДЕ
		|	КонтрольВремениСрезПоследних.Рейс = &Рейс
		|	И КонтрольВремениСрезПоследних.Терминал = &Терминал
		|	И КонтрольВремениСрезПоследних.Событие = &Событие";
	
	Запрос.УстановитьПараметр("Рейс", Рейс);
	Запрос.УстановитьПараметр("Событие", Событие);
	Запрос.УстановитьПараметр("Терминал", Терминал);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ДатаНачалаСобытия = ВыборкаДетальныеЗаписи.Период;
		Возврат  ВыборкаДетальныеЗаписи.ОкончаниеСобытия;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции	


// Реализовать запись событий в БД по триггерам
Процедура ЗаписатьРСКонтрольВремени(Событие, Рейс, ОкончаниеСобытия, Период = Неопределено, Контрагент = Неопределено, Терминал = Неопределено, ДатаРейсов = Неопределено) Экспорт
	
	Если Период = Неопределено ИЛИ Период = Дата("01.01.0001 0:00:00") тогда
		Период = ТекущаяДата();
	КонецЕсли;
	ВыбранныйРегистратор = Документы.РегистрацияСобытияКонтроляВремени.СоздатьДокумент();
	ВыбранныйРегистратор.Дата = Период;
	ВыбранныйРегистратор.Событие = Событие;
	ВыбранныйРегистратор.Рейс = Рейс;
	ВыбранныйРегистратор.Контрагент = Контрагент;
	ВыбранныйРегистратор.ОкончаниеСобытия = ОкончаниеСобытия;
	ВыбранныйРегистратор.ДатаРейсов = ДатаРейсов;
	
	ВыбранныйРегистратор.Пользователь = ПараметрыСеанса.ТекущийПользователь;
	Попытка
		ВыбранныйРегистратор.РабочееМесто = ПараметрыСеанса.РабочееМесто;
	Исключение
		
	КонецПопытки;	
	// МАС - 05.06.2017 - №972 --->> 	 
	ВыбранныйРегистратор.Терминал = ?(ЗначениеЗаполнено(рейс), Рейс.ТерминалДоставки, Терминал);
	// <<--- МАС
	ВыбранныйРегистратор.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
	
КонецПроцедуры


//Процедура ЗаписатьРСКонтрольВремени(Событие, Рейс, ОкончаниеСобытия, Период = Неопределено, Контрагент = Неопределено, Терминал = Неопределено) Экспорт
//	
//	Если Период = Неопределено ИЛИ Период = Дата("01.01.0001 0:00:00") тогда
//		Период = ТекущаяДата();
//	КонецЕсли;
//	ВыбранныйРегистратор = Документы.РегистрацияСобытияКонтроляВремени.СоздатьДокумент();
//	ВыбранныйРегистратор.Дата = Период;
//	ВыбранныйРегистратор.Событие = Событие;
//	ВыбранныйРегистратор.Рейс = Рейс;
//	ВыбранныйРегистратор.Контрагент = Контрагент;
//	ВыбранныйРегистратор.ОкончаниеСобытия = ОкончаниеСобытия;
//	ВыбранныйРегистратор.Пользователь = ПараметрыСеанса.ТекущийПользователь;
//	ВыбранныйРегистратор.РабочееМесто = ПараметрыСеанса.РабочееМесто;
//	// МАС - 05.06.2017 - №972 --->> 	 
//	ВыбранныйРегистратор.Терминал = ?(ЗначениеЗаполнено(рейс), Рейс.ТерминалДоставки, Терминал);
//	// <<--- МАС
//	ВыбранныйРегистратор.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
//	
//КонецПроцедуры
						
Процедура ЗаписатьСобытиеОбновлениеИсторииДанных(Период, ОкончаниеСобытия) Экспорт
	Событие = Справочники.СобытияКонтроляВремени.ОбновлениеИсторииДанных;
	ЗаписатьРСКонтрольВремени(Событие, Неопределено, ОкончаниеСобытия, Период, "", "");
КонецПроцедуры						


Функция РейсАктивен(Рейс) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтрольВремени.Событие КАК Событие
	               |ИЗ
	               |	РегистрСведений.КонтрольВремени КАК КонтрольВремени
	               |ГДЕ
	               |	КонтрольВремени.Рейс = &Рейс
	               |	И КонтрольВремени.Событие = ЗНАЧЕНИЕ(Справочник.СобытияКонтроляВремени.РаспечаткаМаршрутногоЛиста)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	КонтрольВремени.Событие КАК Событие
	               |ИЗ
	               |	РегистрСведений.КонтрольВремени КАК КонтрольВремени
	               |ГДЕ
	               |	КонтрольВремени.Рейс = &Рейс
	               |	И КонтрольВремени.Событие = ЗНАЧЕНИЕ(Справочник.СобытияКонтроляВремени.ЗакрытиеРейсаЛогист)";
	Запрос.УстановитьПараметр("Рейс",Рейс);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	Возврат Не МассивРезультатов[0].Пустой() И МассивРезультатов[1].Пустой() 
КонецФункции
